## Plan Result (test-global)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"
        name                                         = "hmcts-perftest"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-probate" -> "healthProbeSettings-hmcts-access"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/probate"
          ~ load_balancing_name = "loadBalancingSettings-probate" -> "loadBalancingSettings-hmcts-access"
          ~ name                = "probate" -> "hmcts-access"

          ~ backend {
              ~ host_header = "probate.perftest.platform.hmcts.net" -> "hmcts-access.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq" -> "healthProbeSettings-probate"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/pcq"
          ~ load_balancing_name = "loadBalancingSettings-pcq" -> "loadBalancingSettings-probate"
          ~ name                = "pcq" -> "probate"

          ~ backend {
              ~ host_header = "pcq.perftest.platform.hmcts.net" -> "probate.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau" -> "healthProbeSettings-pcq"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/lau"
          ~ load_balancing_name = "loadBalancingSettings-lau" -> "loadBalancingSettings-pcq"
          ~ name                = "lau" -> "pcq"

          ~ backend {
              ~ host_header = "lau.perftest.platform.hmcts.net" -> "pcq.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paybubble" -> "healthProbeSettings-lau"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/paybubble"
          ~ load_balancing_name = "loadBalancingSettings-paybubble" -> "loadBalancingSettings-lau"
          ~ name                = "paybubble" -> "lau"

          ~ backend {
              ~ host_header = "paybubble.perftest.platform.hmcts.net" -> "lau.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-bar" -> "healthProbeSettings-paybubble"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/bar"
          ~ load_balancing_name = "loadBalancingSettings-bar" -> "loadBalancingSettings-paybubble"
          ~ name                = "bar" -> "paybubble"

          ~ backend {
              ~ host_header = "bar.perftest.platform.hmcts.net" -> "paybubble.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fees-register" -> "healthProbeSettings-bar"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/fees-register"
          ~ load_balancing_name = "loadBalancingSettings-fees-register" -> "loadBalancingSettings-bar"
          ~ name                = "fees-register" -> "bar"

          ~ backend {
              ~ host_header = "fees-register.perftest.platform.hmcts.net" -> "bar.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-fees-register"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-fees-register"
          ~ name                = "xui-approve-org" -> "fees-register"

          ~ backend {
              ~ host_header = "administer-orgs.perftest.platform.hmcts.net" -> "fees-register.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "xui-manage-org" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "manage-org.perftest.platform.hmcts.net" -> "administer-orgs.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "xui-register-org" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "register-org.perftest.platform.hmcts.net" -> "manage-org.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ia-aip" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/ia-aip"
          ~ load_balancing_name = "loadBalancingSettings-ia-aip" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "ia-aip" -> "xui-register-org"

          ~ backend {
              ~ host_header = "immigration-appeal.perftest.platform.hmcts.net" -> "register-org.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-ia-aip"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-ia-aip"
          ~ name                = "xui-webapp" -> "ia-aip"

          ~ backend {
              ~ host_header = "manage-case.perftest.platform.hmcts.net" -> "immigration-appeal.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-admin" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/idam-web-admin"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-admin" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "idam-web-admin" -> "xui-webapp"

          ~ backend {
              ~ host_header = "idam-web-admin.perftest.platform.hmcts.net" -> "manage-case.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hmi-apim" -> "healthProbeSettings-idam-web-admin"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/hmi-apim"
          ~ load_balancing_name = "loadBalancingSettings-hmi-apim" -> "loadBalancingSettings-idam-web-admin"
          ~ name                = "hmi-apim" -> "idam-web-admin"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-hmiapimtest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com"
              ~ host_header = "hmi-apim.test.platform.hmcts.net" -> "idam-web-admin.perftest.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-reformscan" -> "healthProbeSettings-hmi-apim"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/reformscan"
          ~ load_balancing_name = "loadBalancingSettings-reformscan" -> "loadBalancingSettings-hmi-apim"
          ~ name                = "reformscan" -> "hmi-apim"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-reformscanperftest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-hmiapimtest.uksouth.cloudapp.azure.com"
              ~ host_header = "reformscanperftest.blob.core.windows.net" -> "hmi-apim.test.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-user-dashboard" -> "healthProbeSettings-reformscan"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/idam-user-dashboard"
          ~ load_balancing_name = "loadBalancingSettings-idam-user-dashboard" -> "loadBalancingSettings-reformscan"
          ~ name                = "idam-user-dashboard" -> "reformscan"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-reformscanperftest.uksouth.cloudapp.azure.com"
              ~ host_header = "idam-user-dashboard.perftest.platform.hmcts.net" -> "reformscanperftest.blob.core.windows.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-dn" -> "healthProbeSettings-idam-user-dashboard"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/div-dn"
          ~ load_balancing_name = "loadBalancingSettings-div-dn" -> "loadBalancingSettings-idam-user-dashboard"
          ~ name                = "div-dn" -> "idam-user-dashboard"

          ~ backend {
              ~ host_header = "decree-nisi-aks.perftest.platform.hmcts.net" -> "idam-user-dashboard.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-da" -> "healthProbeSettings-div-dn"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/div-da"
          ~ load_balancing_name = "loadBalancingSettings-div-da" -> "loadBalancingSettings-div-dn"
          ~ name                = "div-da" -> "div-dn"

          ~ backend {
              ~ host_header = "decree-absolute-aks.perftest.platform.hmcts.net" -> "decree-nisi-aks.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-rfe" -> "healthProbeSettings-div-da"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/div-rfe"
          ~ load_balancing_name = "loadBalancingSettings-div-rfe" -> "loadBalancingSettings-div-da"
          ~ name                = "div-rfe" -> "div-da"

          ~ backend {
              ~ host_header = "respond-divorce-aks.perftest.platform.hmcts.net" -> "decree-absolute-aks.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-pfe" -> "healthProbeSettings-div-rfe"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/div-pfe"
          ~ load_balancing_name = "loadBalancingSettings-div-pfe" -> "loadBalancingSettings-div-rfe"
          ~ name                = "div-pfe" -> "div-rfe"

          ~ backend {
              ~ host_header = "petitioner-frontend-aks.perftest.platform.hmcts.net" -> "respond-divorce-aks.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cft-api-mgmt" -> "healthProbeSettings-div-pfe"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/cft-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-cft-api-mgmt" -> "loadBalancingSettings-div-pfe"
          ~ name                = "cft-api-mgmt" -> "div-pfe"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftapimgmtperftest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com"
              ~ host_header = "cft-api-mgmt.perftest.platform.hmcts.net" -> "petitioner-frontend-aks.perftest.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-adoption-web" -> "healthProbeSettings-cft-api-mgmt"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/adoption-web"
          ~ load_balancing_name = "loadBalancingSettings-adoption-web" -> "loadBalancingSettings-cft-api-mgmt"
          ~ name                = "adoption-web" -> "cft-api-mgmt"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cft-perftest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftapimgmtperftest.uksouth.cloudapp.azure.com"
              ~ host_header = "adoption-web.perftest.platform.hmcts.net" -> "cft-api-mgmt.perftest.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-privatelaw" -> "healthProbeSettings-adoption-web"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/privatelaw"
          ~ load_balancing_name = "loadBalancingSettings-privatelaw" -> "loadBalancingSettings-adoption-web"
          ~ name                = "privatelaw" -> "adoption-web"

          ~ backend {
              ~ host_header = "privatelaw.perftest.platform.hmcts.net" -> "adoption-web.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paymentoutcome-web" -> "healthProbeSettings-privatelaw"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/paymentoutcome-web"
          ~ load_balancing_name = "loadBalancingSettings-paymentoutcome-web" -> "loadBalancingSettings-privatelaw"
          ~ name                = "paymentoutcome-web" -> "privatelaw"

          ~ backend {
              ~ host_header = "paymentoutcome-web.perftest.platform.hmcts.net" -> "privatelaw.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-plum" -> "healthProbeSettings-paymentoutcome-web"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/plum"
          ~ load_balancing_name = "loadBalancingSettings-plum" -> "loadBalancingSettings-paymentoutcome-web"
          ~ name                = "plum" -> "paymentoutcome-web"

          ~ backend {
              ~ host_header = "plum.perftest.platform.hmcts.net" -> "paymentoutcome-web.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-sya" -> "healthProbeSettings-plum"
            id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/backendPools/et-sya"
          ~ load_balancing_name = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-plum"
          ~ name                = "et-sya" -> "plum"

          ~ backend {
              ~ host_header = "et-sya.perftest.platform.hmcts.net" -> "plum.perftest.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-et-sya"
          + load_balancing_name = "loadBalancingSettings-et-sya"
          + name                = "et-sya"

          + backend {
          

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

~ frontend_endpoints = [
              - "nfdiv-apply",
              + "nfdiv",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/nfdiv-applyHttpsRedirect"
          ~ name               = "nfdiv-applyHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-civil",
              + "nfdiv-apply",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/nfdiv-civilHttpsRedirect"
          ~ name               = "nfdiv-civilHttpsRedirect" -> "nfdiv-applyHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "nfdiv-civil",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "nfdiv-civilHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "hmcts-accessHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "probate",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "pcq",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "lau",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "paybubble",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-approve-org",
              + "bar",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/xui-approve-orgHttpsRedirect"
          ~ name               = "xui-approve-orgHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-manage-org",
              + "fees-register",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/xui-manage-orgHttpsRedirect"
          ~ name               = "xui-manage-orgHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-register-org",
              + "xui-approve-org",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/xui-register-orgHttpsRedirect"
          ~ name               = "xui-register-orgHttpsRedirect" -> "xui-approve-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "xui-manage-org",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "xui-manage-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-webapp",
              + "xui-register-org",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/xui-webappHttpsRedirect"
          ~ name               = "xui-webappHttpsRedirect" -> "xui-register-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "ia-aip",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "xui-webapp",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "xui-webappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-dn",
              + "reformscan",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/div-dnHttpsRedirect"
          ~ name               = "div-dnHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-da",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/div-daHttpsRedirect"
          ~ name               = "div-daHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-rfe",
              + "div-dn",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/div-rfeHttpsRedirect"
          ~ name               = "div-rfeHttpsRedirect" -> "div-dnHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-pfe",
              + "div-da",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/div-pfeHttpsRedirect"
          ~ name               = "div-pfeHttpsRedirect" -> "div-daHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "div-rfe",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "div-rfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "div-pfe",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "div-pfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "adoption-web",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "privatelaw",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "paymentoutcome-web",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "paymentoutcome-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "plum",
            ]
            id                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "plumHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.perftest.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          +[0m accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "et-sya",
            ]
          + name               = "et-syaHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.perftest.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (65 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hmcts-access"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest/frontendEndpoints/hmcts-access"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "hmctsaccessperftest"
      + resource_group_name   = "lz-perftest-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1356,"Program":"tfcmt","SHA1":"","Target":"test-global","Vars":{}} -->